load-test/k6/results/test-1/2-min-ingestion-10-vus/insert-app_js_express_js.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


     _js_express_js.................: avg=6.044097 min=2.338  med=5.652  max=224.04   p(90)=7.918  p(95)=8.944 
     data_received..................: 53 MB  442 kB/s
     data_sent......................: 38 MB  317 kB/s
     http_req_blocked...............: avg=2.55µs   min=1µs    med=2µs    max=2.8ms    p(90)=3µs    p(95)=4µs   
     http_req_connecting............: avg=270ns    min=0s     med=0s     max=771µs    p(90)=0s     p(95)=0s    
     http_req_duration..............: avg=6.09ms   min=2.38ms med=5.7ms  max=224.1ms  p(90)=7.97ms p(95)=9ms   
       { expected_response:true }...: avg=6.09ms   min=2.38ms med=5.7ms  max=224.1ms  p(90)=7.97ms p(95)=9ms   
     http_req_failed................: 0.00%  ✓ 0           ✗ 191943
     http_req_receiving.............: avg=37.7µs   min=14µs   med=34µs   max=27.46ms  p(90)=54µs   p(95)=63µs  
     http_req_sending...............: avg=16µs     min=6µs    med=15µs   max=5.13ms   p(90)=21µs   p(95)=23µs  
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s     max=0s       p(90)=0s     p(95)=0s    
     http_req_waiting...............: avg=6.04ms   min=2.33ms med=5.65ms max=224.04ms p(90)=7.91ms p(95)=8.94ms
     http_reqs......................: 191943 1599.486719/s
     iteration_duration.............: avg=6.24ms   min=2.51ms med=5.84ms max=224.26ms p(90)=8.12ms p(95)=9.16ms
     iterations.....................: 191943 1599.486719/s
     vus............................: 10     min=10        max=10  
     vus_max........................: 10     min=10        max=10  


running (2m00.0s), 00/10 VUs, 191943 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s