load-test/k6/results/test-1/2-min-ingestion-10-vus/insert-app_py_fastapi_uvicorn.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: ./scripts/insert-app.js
        output: dashboard http://127.0.0.1:5665

     scenarios: (100.00%) 1 scenario, 10 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 2m0s (gracefulStop: 30s)


     _py_fastapi_uvicorn............: avg=10.836759 min=3.393  med=10.47   max=104.822  p(90)=12.5    p(95)=13.476 
     data_received..................: 19 MB  154 kB/s
     data_sent......................: 22 MB  184 kB/s
     http_req_blocked...............: avg=2.3µs     min=1µs    med=2µs     max=1.61ms   p(90)=3µs     p(95)=3µs    
     http_req_connecting............: avg=235ns     min=0s     med=0s      max=1.39ms   p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=10.88ms   min=3.42ms med=10.51ms max=104.86ms p(90)=12.54ms p(95)=13.53ms
       { expected_response:true }...: avg=10.88ms   min=3.42ms med=10.51ms max=104.86ms p(90)=12.54ms p(95)=13.53ms
     http_req_failed................: 0.00%  ✓ 0          ✗ 108941
     http_req_receiving.............: avg=32.21µs   min=13µs   med=29µs    max=2.67ms   p(90)=45µs    p(95)=53µs   
     http_req_sending...............: avg=13.66µs   min=5µs    med=13µs    max=2.26ms   p(90)=17µs    p(95)=20µs   
     http_req_tls_handshaking.......: avg=0s        min=0s     med=0s      max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=10.83ms   min=3.39ms med=10.47ms max=104.82ms p(90)=12.5ms  p(95)=13.47ms
     http_reqs......................: 108941 907.808418/s
     iteration_duration.............: avg=11ms      min=3.56ms med=10.63ms max=104.97ms p(90)=12.68ms p(95)=13.67ms
     iterations.....................: 108941 907.808418/s
     vus............................: 10     min=10       max=10  
     vus_max........................: 10     min=10       max=10  


running (2m00.0s), 00/10 VUs, 108941 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  2m0s